import streamlit as st


def show_help():
    """
    Справочная информация
    """

    st.info(
        """
        Модуль предназначен для интеллектуального 
        анализа диагностических сообщений высокоскоростного подвижного состава 
        и автоматизации процессов формирования эксплуатационной документации.

        Система обеспечивает:
        - загрузку и фильтрацию диагностических сообщений из базы данных
        - построение хронологии эксплуатационных событий
        - визуальную аналитику состояния подвижного состава и статистики сообщений
        - интеллектуальное формирование текстовых эксплуатационных резюме на основе критических диагностических событий
        - автоматическую фильтрацию служебных и малозначимых сообщений
        - экспорт результатов анализа и протоколов в DOCX, XLSX и CSV
        """
    )